events/Data Storage Events/Metadata.competency/ALERT.Stardom.CompetencyUpdate.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <s:Header></s:Header>
        <s:Body>
            <wsnt:Notify>
                <wsnt:NotificationMessage>
                    <wsnt:Topic></wsnt:Topic>
                    <wsnt:ProducerReference>
		    <wsa:Address>http://www.alert-project.eu/stardom</wsa:Address>
		</wsnt:ProducerReference>
	        <wsnt:Message>
		    <ns1:event xmlns:ns1="http://www.alert-project.eu/"	xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
			<ns1:head>
			    <ns1:sender>STARDOM</ns1:sender>
			    <ns1:timestamp>10000</ns1:timestamp>
			    <ns1:sequencenumber>1</ns1:sequencenumber>
			</ns1:head>
			<ns1:payload>
			    <ns1:meta>
			        <ns1:startTime>10010</ns1:startTime>
			        <ns1:endTime>10010</ns1:endTime>
			        <!-- name of event -->
			        <ns1:eventName>ALERT.Stardom.CompetencyUpdate</ns1:eventName>
			        <ns1:eventId>5748</ns1:eventId>
			        <ns1:eventType>request</ns1:eventType>
			    </ns1:meta>
			    <ns1:eventData>
			        <sm:competency>
                                    <sm:competency>
                                        <sm:uuid>ecb4b1d5cd2a8926a8cb7d7c40050362448b9955fd546bb2706a4a1ece75085c</sm:uuid>
                                        <sm:areas>
                                            <sm:area>
                                                <sm:annotations>
                                                    <sm:annotation>#owl</sm:annotation>
                                                    <sm:annotation>#owl</sm:annotation>
                                                    <sm:annotation>#owl</sm:annotation>
                                                    <sm:annotation>#owl</sm:annotation>
                                                </sm:annotations>
                                                <sm:index>0.22</sm:index>
                                                <sm:attributes>
                                                    <sm:fluency>
                                                        <sm:apiCount>0.01</sm:apiCount>
                                                        <sm:apiIntroduced>0.12</sm:apiIntroduced>
                                                        <sm:staticAnalysis>0.12</sm:staticAnalysis>
                                                    </sm:fluency>
                                                    <sm:contribution>
                                                        <sm:mailingListActivity>0.32</sm:mailingListActivity>
                                                        <sm:itsActivity>0.12</sm:itsActivity>
                                                        <sm:sloc>0.25</sm:sloc>
                                                    </sm:contribution>
                                                    <sm:effectiveness>
                                                        <sm:noOfIssuesFixed>0.001</sm:noOfIssuesFixed>
                                                        <sm:noOfCommitsCausedIssue>0.021</sm:noOfCommitsCausedIssue>
                                                        <sm:noOfCommitFixedIssue>0.001</sm:noOfCommitFixedIssue>
                                                    </sm:effectiveness>
                                                    <sm:recency>
                                                        <!-- Please not the message format contains timezone informatin -->
                                                        <sm:timeSinceSCMaction>Sat, 05 Nov 2011 17:50:11 +0100</sm:timeSinceSCMaction>
                                                        <sm:timeSinceITSaction>Sat, 01 Nov 2011 20:50:11 +0100</sm:timeSinceITSaction>
                                                        <sm:timeSinceMLaction>Sat, 01 Nov 2011 10:50:11 +0100</sm:timeSinceMLaction>
                                                    </sm:recency>
                                                </sm:attributes>
                                            </sm:area>
                                        </sm:areas>
                                    </sm:competency>
                                </sm:competency>
			    </ns1:eventData>
			</ns1:payload>
		    </ns1:event>
	        </wsnt:Message>
	    </wsnt:NotificationMessage>
	</wsnt:Notify>
    </s:Body>
</s:Envelope>